{
  "ABET": {
    "outcome": [
      {
        "type": "CAC",
        "letter": "a",
        "description": "An ability to apply knowledge of computing and mathematics appropriate to the discipline"
      },
      {
        "type": "CAC",
        "letter": "b",
        "description": "An ability to analyze a problem, and identity and define the computing requirements appropriate to its solution"
      },
      {
        "type": "CAC",
        "letter": "c",
        "description": "An ability to design, implement, and evaluate a computer-based system, process, component, or program to meet desired needs"
      },
      {
        "type": "CAC",
        "letter": "d",
        "description": "An ability to function effectively on teams to accomplish a common goal"
      },
      {
        "type": "CAC",
        "letter": "e",
        "description": "An understanding of professional, ethical, legal, security and social issues and responsibilities"
      },
      {
        "type": "CAC",
        "letter": "f",
        "description": "An ability to communicate effectively with a range of audiences"
      },
      {
        "type": "CAC",
        "letter": "g",
        "description": "An ability to analyze the local and global impact of computing on individuals, organizations, and society"
      },
      {
        "type": "CAC",
        "letter": "h",
        "description": "Recognition of the need for and an ability to engage in continuing professional development"
      },
      {
        "type": "CAC",
        "letter": "i",
        "description": "An abiility to use current tecniques, skills, and tools necessary for computing practice."
      },
      {
        "type": "CAC",
        "letter": "j",
        "description": "An ability to apply mathematical foundations, algorithmic principles, and computer science theory in the modeling and design of computer-based systems in a way that demonstrates comprehension of the tradeoffs involved in design choices"
      },
      {
        "type": "CAC",
        "letter": "k",
        "description": "Able to apply design and development pronciples in the construction of software of varying complexity"
      },
      {
        "type": "EAC",
        "letter": "a",
        "description": "An ability to apply knowledge of mathematics, science, and engineering."
      },
      {
        "type": "EAC",
        "letter": "b",
        "description": "An ability to design and conduct experiments, as well as to analyze and interpret data."
      },
      {
        "type": "EAC",
        "letter": "c",
        "description": "An ability to design a system, component or process to meet desired needs within realistic constrains such as economic, environmental, social, political, ethical, health and safety, manufacturing and sustainability."
      },
      {
        "type": "EAC",
        "letter": "d",
        "description": "An ability to function multidisciplinary teams."
      },
      {
        "type": "EAC",
        "letter": "e",
        "description": "An ability to identift, formulate, and solve engineering problems."
      },
      {
        "type": "EAC",
        "letter": "f",
        "description": "Understanding of professional and ethical responsibility."
      },
      {
        "type": "EAC",
        "letter": "g",
        "description": "Ability to communicate effectively."
      },
      {
        "type": "EAC",
        "letter": "h",
        "description": "The broad education necessary to understand the impact of engineering solutions in a global, economic, environmental and societal context."
      },
      {
        "type": "EAC",
        "letter": "i",
        "description": "Recofnition of the need for, and an ability to engage in life-long learning."
      },
      {
        "type": "EAC",
        "letter": "j",
        "description": "A knowledge of contemporary issues."
      },
      {
        "type": "EAC",
        "letter": "k",
        "description": "An ability to use the techniques, skills, and modern engineering tools necessary for engineering practice."
      }
    ]
  }
}